In [28]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [29]:
# *Data Filteration

In [30]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [31]:
# Binmning of age column into 7 categories
bins = [0,1,5,12,18,30,50,80]
labels = ['infants', ' toddlers' , 'kids', 'teens','youngs', 'middle age', 'old']
#kis column ko bin mnn convert krna ha

df['age_group'] = pd.cut(df['age'], bins=bins , labels=labels)
df['age_group'].value_counts()

age_group
youngs        270
middle age    241
teens          70
old            64
 toddlers      30
kids           25
infants        14
Name: count, dtype: int64

In [32]:
df.columns
df_01 = df[['survived', 'age_group', 'fare', 'class']]
df_01.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   survived   891 non-null    int64
 1   age_group  714 non-null    category
 2   fare       891 non-null    float64
 3   class      891 non-null    category
dtypes: category(2), float64(1), int64(1)
memory usage: 16.3 KB

# How to Seperate A Data You Require ***For Categorigal Variables***

In [33]:
df['class'].value_counts()

class
Third     491
First     216
Second    184
Name: count, dtype: int64

In [34]:
df_first = df_01[df_01['class'] == 'First']

In [35]:
df_first['class'].value_counts()

class
First     216
Second      0
Third       0
Name: count, dtype: int64

# How to Seperate A Data You Require ***For Numeric Variables***

In [36]:
df['fare'].max()

512.3292

In [53]:
# lETS sELECT ONLY THOSE ROWS Having Fare More then 200
df_02 = df_01[df_01['fare'] > 74]
df_02.info()

<class 'pandas.core.frame.DataFrame'>
Index: 97 entries, 27 to 879
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   survived   97 non-null     int64
 1   age_group  89 non-null     category
 2   fare       97 non-null     float64
 3   class      97 non-null     category
dtypes: category(2), float64(1), int64(1)
memory usage: 2.9 KB

In [54]:
df_02['class'].value_counts()

class
First     97
Second     0
Third      0
Name: count, dtype: int64

# **How to Add Two Filters**

In [57]:
df_01[(df_01['fare'] > 74) & (df_01['class'] == 'First')].sort_values(by='fare')

     survived   age_group      fare  class
366         1         old   75.2500  First
218         1  middle age   76.2917  First
52          1  middle age   76.7292  First
645         1  middle age   76.7292  First
681         1      youngs   76.7292  First
..        ...         ...       ...    ...
341         1      youngs  263.0000  First
27          0      youngs  263.0000  First
737         1  middle age  512.3292  First
679         1  middle age  512.3292  First
258         1  middle age  512.3292  First

[97 rows x 4 columns]